#+title: esp
#+author: nls
* /pyboard/src io
#+begin_src python :results raw :tangle ./tools/emacs.py
from os import popen
from sys import path; path.insert(1, "/home/nls/py/org-tools");
from emacs_org import org_table, file_link, shell_link, sum_formula
"""this script outputs an emacs-org table (simple ascii table with '-' and '|'),
    which is programmatically aggregated.
    Since this is meant to be used in an org-file,
    there is a return statement in the global scope"""

src = "./src/"              # src directory from where files are grabbed
url = "192.168.43.31:/"     # ws domain where files are transferred [col 'esp']
files = popen(f"ls {src}").read().split("\n")[:-1]

webrepl_cli_bin = "/home/$USER/py/esp/webrepl/webrepl_cli.py" # [col 'esp']
# because it sucks to always read, especially with the last '\n'
pop = lambda c: popen(c).read()[:-1].split()


loc = lambda f: " / ".join([
    pop(f"cat {f} | sed '/^\s*#/d;/^\s*$/d' | wc -l")[0],
    pop(f"cat {f} | wc -w")[0]]).replace(", ", "")

return org_table(rows=(
    dict(head= "files",
         body= lambda f: file_link(src + f, f),
         tail= f"[[file:{src}][{src}]]"),
    dict(head= "esp",
         body= lambda f: shell_link(f"{webrepl_cli_bin} {src}{f} {url}{f}", "->"),
         tail= "[[shell:sudo rshell -p /dev/ttyUSB0 -b 115200 &][$]]"),
    dict(head= "loc / wc",
         body= lambda f: loc(src + f),
         tail= loc(f"{src}*")),
    dict(head= "du",
         body= lambda f: pop(f"du -h {src}{f}")[0],
         tail= sum_formula(2,-1))),
  body_itter=files)
#+end_src
#+RESULTS:
| files               | esp | loc / wc    | du              |
|---------------------+-----+-------------+-----------------|
| [[file:./src/api.py][api.py]]              | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/api.py 192.168.43.31:/api.py &][->]]  | 99 / 266    | 4.0K            |
| [[file:./src/boot.py][boot.py]]             | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/boot.py 192.168.43.31:/boot.py &][->]]  | 14 / 39     | 4.0K            |
| [[file:./src/gpio.py][gpio.py]]             | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/gpio.py 192.168.43.31:/gpio.py &][->]]  | 98 / 500    | 4.0K            |
| [[file:./src/main.py][main.py]]             | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/main.py 192.168.43.31:/main.py &][->]]  | 5 / 17      | 4.0K            |
| [[file:./src/microdot_asyncio.py][microdot_asyncio.py]] | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/microdot_asyncio.py 192.168.43.31:/microdot_asyncio.py &][->]]  | 265 / 1108  | 12K             |
| [[file:./src/microdot.py][microdot.py]]         | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/microdot.py 192.168.43.31:/microdot.py &][->]]  | 728 / 3134  | 32K             |
| [[file:./src/micro_func.py][micro_func.py]]       | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/micro_func.py 192.168.43.31:/micro_func.py &][->]]  | 24 / 149    | 4.0K            |
| [[file:./src/playground.py][playground.py]]       | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/playground.py 192.168.43.31:/playground.py &][->]]  | 31 / 78     | 4.0K            |
| [[file:./src/pt100.py][pt100.py]]            | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/pt100.py 192.168.43.31:/pt100.py &][->]]  | 73 / 590    | 8.0K            |
| [[file:./src/repl.py][repl.py]]             | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/repl.py 192.168.43.31:/repl.py &][->]]  | 15 / 72     | 4.0K            |
| [[file:./src/urequests.py][urequests.py]]        | [[shell:/home/$USER/py/esp/webrepl/webrepl_cli.py ./src/urequests.py 192.168.43.31:/urequests.py &][->]]  | 179 / 680   | 8.0K            |
| [[file:./src/][./src/]]              | [[shell:sudo rshell -p /dev/ttyUSB0 -b 115200 &][$]]   | 1531 / 6633 | :=vsum(@2..@-1) |

#+begin_src python :tangle ~/sys_cfg/snippets/tmp
import uasyncio; from api import coro, run_coro
#+end_src

** curl-gen
#+begin_src python :results raw
def gen(raw=True):
    for lisp in ( ("get", 2, 33), ("set", 2, 33),
                  ("get", (2,{"value":1}))):
        yield f"*{lisp[0]}*"
        for arg in lisp[1:]:
            no_args = lambda: isinstance(arg, int)
            pin = arg if no_args else arg[0]
            arg = ( "" if no_args
                    else "-G " + " ".join([f"-d \"{k}={arg[1][k]}\""
                                          for k in arg[1]]))

            yield f"[[shell:curl 192.168.43.31:5000/api/gpio/{lisp[0]}/{pin}]" \
                + ("]" if raw else f"[/{lisp[0]}/{pin}]]")

return "\n".join(list(gen())    )
#+end_src

#+RESULTS:
*get*
[[shell:curl 192.168.43.31:5000/api/gpio/get/2]]
[[shell:curl 192.168.43.31:5000/api/gpio/get/33]]
*set*
[[shell:curl 192.168.43.31:5000/api/gpio/set/2]]
[[shell:curl 192.168.43.31:5000/api/gpio/set/33]]
*get*
[[shell:curl 192.168.43.31:5000/api/gpio/get/(2, {'value': 1})]]

[[API][api spec]]
** API
[[curl (test API)][test the api with curl]]
[[shell:cat ~/py/esp/docs.json|sed 's,\":,\n\t\t,'|sed  's,{,,'|sed 's,},,'|sed 's,\",,'|sed 's.,..' | sed 's,\\n,\n,' &][read            <- docs.json]]
[[doc extractor (docer.py)][generate docs   -> docs.json]]
#+begin_src python
return "\n".join([l for l in open("./src/api.py", "r").readlines() if l[0] == "@"])
#+end_src

#+RESULTS:
: @app.before_request
:
: @app.route('/')
:
: @app.route('/api/gpio')
:
: @app.route('/api/gpio/<function>')

